USE `station`;

INSERT INTO `users` VALUES (14,'vasya','df4c8aef9f221490a3aa75b59df67ca2','Васильев','Василий','Васильевич','ADMINISTRATOR',''),(15,'senya','5faf6461e42c87cf9ac8a023eb348f9c','Борисов','Семен','Семонович','SUBSCRIBER',''),(16,'gena','cdffae47bdae9339a29cf774665a3dc1','Петров','Петр','Петрович','SUBSCRIBER',''),(20,'stats','7fc670bb9ec784afa468bb82438a3990','Ларионов','Станислав','Витальевич','SUBSCRIBER',''),(22,'nata','32aa3e905a67dfc52ed9d53bc09f40e1','Заречная','Наталья','Владимировна','SUBSCRIBER','\0');

INSERT INTO `administrators` VALUES (14,74894254,'дворник');

INSERT INTO `prefixes` VALUES (17,'Минск'),(212,'Витебск');

INSERT INTO `subscribers` VALUES (15,'3300187EA013PB8','2000-12-28','ул. Титова д. 46, корп. 1, кв. 10',212,240324,14),(16,'3300187EA023PB8','1999-01-18','sdk',212,240311,14),(20,'3300187EA033PB8','1970-01-01','ул. Ленинградская 88, оф. 6',212,240317,14),(22,'3071175BA042JF8','1970-01-01','ул. Ленинградская 88, оф. 6',212,240318,14);

INSERT INTO `offers` VALUES (1,'CLIP','Идентификация линии вызывающего абонента позволяет увидеть на дисплее абонентского устройства номер телефона вызывающего абонента.',0.86,0,'\0'),(2,'Абонентская плата','Услуги электросвязи общего пользования.',3.01,0,''),(3,'Музыкальный марафон','Позволяет заменить стандартный тон вызова телефонной линии мелодиями.',0.5,0,'\0'),(4,'Виртуальный номер','Предназначена для физических лиц, которым необходимо дать рекламное или информационное объявление, не указывая реальные номера телефонов.',3.67,11.95,'\0'),(9,'Элитный номер','Абоненту предоставляется возможность выбора номера из перечня свободных номеров телефонной станции.',5.01,16.99,'\0');

INSERT INTO `subscriptions` VALUES (2,15,3,'2018-01-04 04:56:18','2018-01-06 13:22:18'),(3,15,9,'2018-01-04 04:56:46','2018-01-06 13:22:18'),(4,22,9,'2018-01-05 10:32:07',NULL),(5,15,4,'2018-01-05 10:54:25','2018-01-06 15:59:14'),(6,15,1,'2018-01-05 10:54:27',NULL);

INSERT INTO `rates` (`id`, `type`, `introdutionDate`, `tariff`) VALUES
(1, 'LOCAL_OUTGOING', '2018-01-07 19:19:05', 0.1),
(2, 'LOCAL_INCOMING', '2018-01-07 19:19:05', 0),
(3, 'LONG_DISTANCE_OUTGOING', '2018-01-07 19:19:16', 0.2),
(4, 'LONG_DISTANCE_INCOMING', '2018-01-07 19:19:16', 0),
(5, 'MOBILE_OUTGOING', '2018-01-07 19:19:26', 0.3),
(6, 'MOBILE_INCOMING', '2018-01-07 19:19:26', 0),
(7, 'LOCAL_OUTGOING', '2018-01-07 19:21:22', 0.11),
(8, 'LOCAL_INCOMING', '2018-01-07 19:21:42', 0.01),
(9, 'LOCAL_INCOMING', '2018-01-07 19:21:49', 0);